[Timeout] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        this._distribution = new Map();
-        if(faces >= 2){
-            this._faces = faces;
-            for (let i = 1; i <= faces; i++) {
-                this._distribution.set(i, 0);
-                }
-            }
-        
-        else{
-            this._faces = 6;
-            for (let i = 1; i <= this._faces; i++) {
-                this._distribution.set(i, 0);
-                }
-            
-        }
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 

[Killed] BlockStatement
src/Roller.ts:11:23
     // six-sided die.
     constructor(faces: number) {
         this._distribution = new Map();
-        if(faces >= 2){
-            this._faces = faces;
-            for (let i = 1; i <= faces; i++) {
-                this._distribution.set(i, 0);
-                }
-            }
+        if(faces >= 2){}
         
         else{
killedBy: Die should be to the value entered if valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/Roller.ts:11:12
     // six-sided die.
     constructor(faces: number) {
         this._distribution = new Map();
-        if(faces >= 2){
+        if(faces < 2){
             this._faces = faces;
             for (let i = 1; i <= faces; i++) {
killedBy: If the die defaults to 6 if the value entered is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] EqualityOperator
src/Roller.ts:13:29
         this._distribution = new Map();
         if(faces >= 2){
             this._faces = faces;
-            for (let i = 1; i <= faces; i++) {
+            for (let i = 1; i < faces; i++) {
                 this._distribution.set(i, 0);
                 }
killedBy: Die should be to the value entered if valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] EqualityOperator
src/Roller.ts:13:29
         this._distribution = new Map();
         if(faces >= 2){
             this._faces = faces;
-            for (let i = 1; i <= faces; i++) {
+            for (let i = 1; i > faces; i++) {
                 this._distribution.set(i, 0);
                 }
killedBy: Die should be to the value entered if valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/Roller.ts:18:13
                 }
             }
         
-        else{
-            this._faces = 6;
-            for (let i = 1; i <= this._faces; i++) {
-                this._distribution.set(i, 0);
-                }
-            
-        }
+        else{}
     }
 
killedBy: If the die defaults to 6 if the value entered is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] EqualityOperator
src/Roller.ts:20:29
         
         else{
             this._faces = 6;
-            for (let i = 1; i <= this._faces; i++) {
+            for (let i = 1; i > this._faces; i++) {
                 this._distribution.set(i, 0);
                 }
killedBy: If the die defaults to 6 if the value entered is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] BlockStatement
src/Roller.ts:20:52
         
         else{
             this._faces = 6;
-            for (let i = 1; i <= this._faces; i++) {
-                this._distribution.set(i, 0);
-                }
+            for (let i = 1; i <= this._faces; i++) {}
             
         }
killedBy: If the die defaults to 6 if the value entered is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] BlockStatement
src/Roller.ts:37:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        if(value <= this._faces){
-            let x = this._distribution.get(value);
-            this._distribution.set(value, x+1)
-            this._last = value;
-            return value;
-        }
-        else{
-            return 0;
-        }
-        
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: If the Roll is between 1-entered value, should return value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:38:12
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if(value <= this._faces){
+        if(false){
             let x = this._distribution.get(value);
             this._distribution.set(value, x+1)
killedBy: If the Roll is between 1-entered value, should return value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/Roller.ts:38:33
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if(value <= this._faces){
-            let x = this._distribution.get(value);
-            this._distribution.set(value, x+1)
-            this._last = value;
-            return value;
-        }
+        if(value <= this._faces){}
         else{
             return 0;
killedBy: If the Roll is between 1-entered value, should return value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
src/Roller.ts:40:43
     roll(value: number): number{
         if(value <= this._faces){
             let x = this._distribution.get(value);
-            this._distribution.set(value, x+1)
+            this._distribution.set(value, x - 1)
             this._last = value;
             return value;
killedBy: If the Roll is between 1-entered value, should increment map value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[NoCoverage] BlockStatement
src/Roller.ts:44:13
             this._last = value;
             return value;
         }
-        else{
-            return 0;
-        }
+        else{}
         
     }

[Killed] BlockStatement
src/Roller.ts:52:20
 
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
-    last(): number {
-        if(this._last > 0){
-         return this._last;
-        }
-        return 0;
-    }
+    last(): number {}
 
     // returns a Map that represents the current distribution of rolls for each
killedBy: If the Roll is not valid between 1-entered value, should store in last
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:53:12
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
     last(): number {
-        if(this._last > 0){
+        if(true){
          return this._last;
         }
killedBy: If the Roll is not valid between 1-entered value, should store in last
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] EqualityOperator
src/Roller.ts:53:12
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
     last(): number {
-        if(this._last > 0){
+        if(this._last <= 0){
          return this._last;
         }
killedBy: If the Roll is not valid between 1-entered value, should store in last
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1
